In [1]:
!pip install mysql-connector

Collecting mysql-connector
  Downloading mysql-connector-2.2.9.tar.gz (11.9 MB)
     ---------------------------------------- 0.0/11.9 MB ? eta -:--:--
      --------------------------------------- 0.3/11.9 MB ? eta -:--:--
     ----- ---------------------------------- 1.6/11.9 MB 6.5 MB/s eta 0:00:02
     --------- ------------------------------ 2.9/11.9 MB 7.0 MB/s eta 0:00:02
     --------------- ------------------------ 4.7/11.9 MB 7.7 MB/s eta 0:00:01
     ------------------------ --------------- 7.3/11.9 MB 8.5 MB/s eta 0:00:01
     ------------------------------- -------- 9.4/11.9 MB 9.0 MB/s eta 0:00:01
     ---------------------------------------  11.8/11.9 MB 9.3 MB/s eta 0:00:01
     ---------------------------------------- 11.9/11.9 MB 9.2 MB/s eta 0:00:00
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Building wheels for collected packages: mysql-connector
  Building wheel for mysql-connector (setup.py): started
  Building wheel for mysql-connector (setup.py): finished with status 'done'
  Created wheel for mysql-connector: filename=mysql_connector-2.2.9-cp312-cp312-win_amd64.whl size=247959 sha256=fe6a5250cc8b0e5eebdec6ce7f6990bfe6b426d9c71e4f8c6d11bbe90bbdbe0e
  Stored in directory: c:\users\hp\appdata\local\pip\cache\wheels\03\17\fa\d7604c72dd3dd6d3eb3d249abf36cc532c9a9b4354b8f1bc4f
Successfully built mysql-connector
Installing collected packages: mysql-connector
Successfully installed mysql-connector-2.2.9

In [9]:
import mysql.connector               #importing database
database=mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="python_630am"
)
db=database.cursor()

In [13]:
db.execute("select * from student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 87, 70, 75, 71, 82, 385, 82.0, 'A')
(2, 'Shyam', 87, 75, 66, 82, 90, 410, 85.0, 'A')

In [15]:
#insert data into tables
sql='''INSERT INTO `student` (`sn`, `Name`, `physics`, `chemistry`, `math`, `english`, `nepali`, `total`, `per`, `grade`) 
VALUES ('10', 'Shriyanshi', '60', '72', '90', '85', '90', '410', '82', 'A');'''
db.execute(sql)
database.commit()
print(db.rowcount, "record inserted")

1 record inserted

In [17]:
sql='''INSERT INTO `student` (`sn`, `Name`, `physics`, `chemistry`, `math`, `english`, `nepali`, `total`, `per`, `grade`) 
VALUES ('11', 'Daman', '63', '54', '65', '71', '62', '305', '60', 'B');'''
db.execute(sql)
database.commit()
print(db.rowcount, "record inserted")

1 record inserted

In [19]:
db.execute("select * from student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 87, 70, 75, 71, 82, 385, 82.0, 'A')
(2, 'Shyam', 87, 75, 66, 82, 90, 410, 85.0, 'A')
(3, 'Hari', 75, 90, 78, 68, 54, 350, 75.0, 'B')
(4, 'Gita', 58, 72, 68, 85, 63, 310, 67.0, 'B')
(5, 'Mohan', 50, 63, 62, 54, 69, 290, 65.0, 'B')
(6, 'Binod', 85, 90, 78, 92, 85, 450, 88.0, 'A')
(7, 'Gajendra', 75, 71, 63, 55, 65, 330, 66.0, 'B')
(8, 'Sharmila', 74, 85, 92, 72, 70, 410, 83.0, 'A')
(9, 'Shriyansh', 60, 72, 82, 85, 90, 400, 80.0, 'A')
(10, 'Shriyanshi', 60, 72, 90, 85, 90, 410, 82.0, 'A')
(11, 'Daman', 63, 54, 65, 71, 62, 305, 60.0, 'B')

In [13]:
import mysql.connector               #importing database
database=mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="python_630am"
)
db=database.cursor()

In [19]:
#update in sql 
sql="UPDATE student SET name='Rama' WHERE sn=2"
db.execute(sql)
database.commit()
print(db.rowcount,"record(s) affected")

0 record(s) affected

In [21]:
#select
db.execute("SELECT *FROM  student WHERE grade='A'")
result=db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 87, 70, 75, 71, 82, 385, 82.0, 'A')
(2, 'Rama', 87, 75, 66, 82, 90, 410, 85.0, 'A')
(6, 'Binod', 85, 90, 78, 92, 85, 450, 88.0, 'A')
(8, 'Sharmila', 74, 85, 92, 72, 70, 410, 83.0, 'A')
(9, 'Shriyansh', 60, 72, 82, 85, 90, 400, 80.0, 'A')
(10, 'Shriyanshi', 60, 72, 90, 85, 90, 410, 82.0, 'A')

In [23]:
# select
db.execute("SELECT name,total,grade FROM student WHERE grade='A'")
result=db.fetchall()
for x in result:
    print(x)

('Ram', 385, 'A')
('Rama', 410, 'A')
('Binod', 450, 'A')
('Sharmila', 410, 'A')
('Shriyansh', 400, 'A')
('Shriyanshi', 410, 'A')

In [25]:
db.execute("SELECT * FROM student WHERE physics>80")
result=db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 87, 70, 75, 71, 82, 385, 82.0, 'A')
(2, 'Rama', 87, 75, 66, 82, 90, 410, 85.0, 'A')
(6, 'Binod', 85, 90, 78, 92, 85, 450, 88.0, 'A')

In [27]:
database.commit()

In [29]:
db.execute("SELECT * FROM student WHERE name LIKE '%ram%'")
result=db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 87, 70, 75, 71, 82, 385, 82.0, 'A')
(2, 'Rama', 87, 75, 66, 82, 90, 410, 85.0, 'A')
(3, 'Balaram', 75, 90, 78, 68, 54, 350, 75.0, 'B')

In [31]:
db.execute("SELECT * FROM student WHERE physics >80 or chemistry=80")
result=db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 87, 70, 75, 71, 82, 385, 82.0, 'A')
(2, 'Rama', 87, 75, 66, 82, 90, 410, 85.0, 'A')
(6, 'Binod', 85, 90, 78, 92, 85, 450, 88.0, 'A')

In [35]:
db.execute("SELECT *FROM student ORDER by total DESC LIMIT 3")
result= db.fetchall()
for x in result:
    print(x)

(6, 'Binod', 85, 90, 78, 92, 85, 450, 88.0, 'A')
(2, 'Rama', 87, 75, 66, 82, 90, 410, 85.0, 'A')
(8, 'Sharmila', 74, 85, 92, 72, 70, 410, 83.0, 'A')

In [39]:
#update in sql
name= input("Enter name=")
sn=int(input("Enter sn="))
sql=f"UPDATE student SET name='{name}' WHERE sn={sn}"
db.execute(sql)
database.commit()
print(db.rowcount,"record(s) affected")

Enter name= Hari
Enter sn= 3

1 record(s) affected